trade_exp/src/InformationRegisters/ДанныеБезналичныхОплат/ДанныеБезналичныхОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3db7f2b-6046-4767-a8e0-5431ea1f8e26">
  <name>ДанныеБезналичныхОплат</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="298e0de6-3a02-4703-8f53-df3a8f85d7c6">
    <name>ДокументОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="76496f61-091c-428f-a918-1ecd5056e823">
    <name>IDТранзакции</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="d07670eb-922b-445d-afdc-27fbd65f46fc">
    <name>СБП</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ТипыПлатежнойСистемыККТ/ТипыПлатежнойСистемыККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17d6d642-f9f4-4184-9494-c31448761a97">
  <name>ТипыПлатежнойСистемыККТ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="fc13509e-eb4f-4d15-beb7-65b67ba34e89">
    <name>ПлатежнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e225080a-7355-4bd6-93f0-9701a233c00a">
    <name>СертификатНСПК</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="058b36d9-0f38-4998-bd16-e38c9448a1ce">
    <name>СистемаБыстрыхПлатежей</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДополнительныеОтчетыИОбработки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="3c54d440-e908-43d6-a5cc-bb64620c82d7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf1dd911-8ee1-407b-acae-10c85b74baf3">
    <name>Публикация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fdbbbf8b-dacf-436e-8d8b-1e2b8e854b17">
    <name>ИспользоватьДляФормыСписка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="66364cd4-aaa5-421d-96d6-3c283c14650d">
    <name>ИспользоватьДляФормыОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ebef37c6-4808-4683-93be-036ce19cafd5">
    <name>Информация</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="532637ef-be0d-4f42-9747-a88e17eb3def">
    <name>Версия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="61127152-3e24-40b4-8a23-5eb6cae568ff">
    <name>Вид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad1142ed-183d-47a3-800c-997a3770e11e">
    <name>ИмяФайла</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ffd987e3-e8af-4d46-881e-1e312e74dbac">
    <name>ИмяОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="23a240a2-52ee-46ab-89d9-50dcee2cc8d2">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7acd5f4d-55de-443c-a5e5-404b1e77d13f">
    <name>ВключитьОграниченияФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="93e9c43a-d522-4b3f-8faa-3e0a83aa610e">
    <name>ТолькоНаБазеTrade</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="136703ac-c000-4bb3-b150-be3adc900fdb">
    <name>ВестиЛогирование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0481bc65-6a32-46b9-ae87-993ba52a29a5">
    <name>Команды</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c708f6e9-b7a0-4046-90f3-83527da7b872">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="00974661-42a8-46e7-9e21-6f9141d0fb48">
    <name>ПараметрыИОтборы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="315022f6-3549-4d2d-8ada-cdaf7148b493">
      <name>Наименование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c27cc284-6d41-4dcc-a424-f5545e73c073">
      <name>Обязательный</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="86a4432d-ae7d-40f5-bb5d-9f8157f2ff8f">
      <name>ЭтоПараметр</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="566340cb-bbfc-49cd-850d-dd5cbc126c44">
      <name>ПериодПараметра</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/CommonModules/ИнтеграцияСБПГазпромбанк/Module.bsl
//адрес сервера sbp.gazprombank.ru
// порт 9443
//прокси https
Функция ПолучитьПараметрыСоединения(АдресСервера = "sbp.gazprombank.ru" , Порт=9443, Логин=Неопределено, Пароль=Неопределено, ИспользоватьSSL=Истина, ИДУстройства="") Экспорт
	//СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	//Если СтруктураНастроек.Свойство("АдресСервера") Тогда
	//	АдресСервера = СтруктураНастроек.АдресСервера;
	//КонецЕсли;
	
	ПараметрыПодключения = Новый Структура;
	
	ПараметрыПодключения.Вставить("Логин", Логин);	
	ПараметрыПодключения.Вставить("Пароль",	Пароль);	
	ПараметрыПодключения.Вставить("АдресСервера", АдресСервера);	 
	ПараметрыПодключения.Вставить("Порт", Порт);	
	ПараметрыПодключения.Вставить("ИспользоватьSSL", ИспользоватьSSL);	
	ПараметрыПодключения.Вставить("ИДУстройства", ИДУстройства);
	ПараметрыПодключения.Вставить("Таймаут", 0);
	
	Возврат ПараметрыПодключения;
КонецФункции

Функция ПолучитьHTTPСоединение(ПараметрыПодключения) Экспорт
	
	ssl = ?(ПараметрыПодключения.ИспользоватьSSL,Новый ЗащищенноеСоединениеOpenSSL,НЕОПРЕДЕЛЕНО);
	
	Соединение = Новый HTTPСоединение(
	ПараметрыПодключения.АдресСервера, 
	ПараметрыПодключения.Порт, 
	ПараметрыПодключения.Логин, 
	ПараметрыПодключения.Пароль, 
	ПолучениеФайловИзИнтернета.ПолучитьПрокси("https"), 
	ПараметрыПодключения.Таймаут, 
	ssl  
	);
	
	Возврат Соединение;
КонецФункции

Функция ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, ТипЗапроса="GET", Заголовки=Неопределено, Данные=Неопределено) Экспорт
	ЕстьОшибка= Ложь;
	Если НЕ АльтерраОбщегоНазначения.ЭтоРабочаяБаза() Тогда
		Возврат "Попытка работы с СБП Газпромбанка в тестовой базе";
	КонецЕсли;	
	
	Попытка
		HTTPЗапрос= Новый HTTPЗапрос(АдресЗапроса); 
		Если ТипЗнч(Заголовки) = Тип("Соответствие") Тогда
			Для каждого Заголовок из Заголовки Цикл
				HTTPЗапрос.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
			КонецЦикла;
		КонецЕсли;
		
		HTTPЗапрос.УстановитьТелоИзСтроки(Данные);
		
		Если ТипЗапроса="GET" Тогда
			Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		ИначеЕсли ТипЗапроса="POST" Тогда
			Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли ТипЗапроса="PUT" Тогда
			Ответ = HTTPСоединение.Записать(HTTPЗапрос);
		ИначеЕсли ТипЗапроса="DELETE" Тогда
			Ответ = HTTPСоединение.Удалить(HTTPЗапрос);
		КонецЕсли;
				
		ОтветТело= Ответ.ПолучитьТелоКакСтроку();
		
		ДанныеОтвета= ДесериализоватьИзJSON(ОтветТело);  
		
		Текст= СтрШаблон("Выполнен %1 запрос %2 с данными %3. Ответ %4", ТипЗапроса, АдресЗапроса, Данные, ОтветТело);
		ЗаписьЖурналаРегистрации("СБП Газпромбанк", УровеньЖурналаРегистрации.Информация,,,Текст);

	Исключение
		Инфо = ИнформацияОбОшибке();
		Текст= СтрШаблон("Ошибка выполнения %1 запроса: %2. %3", ТипЗапроса, АдресЗапроса, Инфо.Описание);
		Возврат Текст;

	КонецПопытки;
	
	Возврат ДанныеОтвета;
КонецФункции 

Функция СериализоватьВJSON(Данные) Экспорт   
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, ,Истина));
		ЗаписатьJSON(ЗаписьJSON, Данные);
		ПараметрыJSON = ЗаписьJSON.Закрыть();
		Возврат ПараметрыJSON;
	Исключение
		Сообщить("Ошибка JSON");
		Возврат "{}";
	КонецПопытки;
КонецФункции

Функция ДесериализоватьИзJSON(СтрокаJSON) Экспорт  
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);   
	Результат = Неопределено;
	Результат = ПрочитатьJSON(ЧтениеJSON,, "dateTime, dateTimeSbpMsg", ФорматДатыJSON.ISO);	
	ЧтениеJSON.Закрыть();
	
    Возврат Результат;
КонецФункции

Функция ПолучитьОбработку() Экспорт
	
	ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", "СБПГазпромбанк");		
		
	Возврат ДополнительнаяОбработка;
	
КонецФункции

Функция ПолучитьСтруктуруХранилищаНастроек(ДополнительнаяОбработка=Неопределено) Экспорт
	
	ОписаниеОшибки = "";	
	Если ДополнительнаяОбработка=Неопределено Тогда
		ДополнительнаяОбработка = ПолучитьОбработку();
	Конецесли;
	Если НЕ ДополнительнаяОбработка.Пустая() Тогда
		
		НастройкиХранилища = ДополнительнаяОбработка.ХранилищеНастроек.Получить();		
		
		Если НастройкиХранилища <> Неопределено Тогда
			Возврат НастройкиХранилища;
		Иначе	
			ОписаниеОшибки = "Настройки выполнения не заданы";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОписаниеОшибки;
	
КонецФункции



Функция АктивацияКассовойСсылки(ДанныеЗаполнения) Экспорт
	Данные = Новый Структура;
	Данные.Вставить("qrcId", ДанныеЗаполнения.qrcId);
	Данные.Вставить("amount", ДанныеЗаполнения.amount);
	Если ДанныеЗаполнения.Свойство("paymentPurpose") Тогда
		Данные.Вставить("paymentPurpose", ДанныеЗаполнения.paymentPurpose);
	КонецЕсли;
	Данные.Вставить("currency", "RUB");
	Если ДанныеЗаполнения.Свойство("qrTtl") Тогда
		Данные.Вставить("qrTtl", ДанныеЗаполнения.qrTtl);
    КонецЕсли;
	//Данные.Вставить("sign",""); 
		
	ДанныеJSON = СериализоватьВJSON(Данные);
	
	ПараметрыПодключения = ПолучитьПараметрыСоединения();
	HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json");
	//Заголовки.Вставить("Authorization", "");  //Логин и пароль закодированные согласно Basic auth
	//Заголовки.Вставить("login", "");          //Логин выданный ТСП 
	//Заголовки.Вставить("password", "");
	АдресЗапроса = "/merchant/payment/v1/cash-activate-qrc/params";
	Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);
	
	Возврат Ответ;
	//обработка ответа на стороне формы сбп
	//Если ТипЗнч(Ответ) = Тип("Структура") Тогда
	//	Если Ответ.Свойство("data") тогда
	//		qrcId = Ответ.data.qrcId;
	//		paramsId = Ответ.data.paramsId;	
	//		amount = Ответ.data.amount;
	//		currency = Ответ.data.currency;
	//		Если Ответ.data.Свойство("paymentPurpose") Тогда
	//			paymentPurpose = Ответ.data.paymentPurpose;
	//		КонецЕсли;
	//		
	//	Иначе
	//		КодОшибки = Ответ.code;
	//		ТекстОшибки = Ответ.message;
	//	КонецЕсли;		 
	//ИначеЕсли ТипЗнч(Ответ) = Тип("Строка") Тогда
	//    //сообщить ошибку из ответа
	//КонецЕсли;	
	
КонецФункции   

Функция ДеактивацияКассовойСсылки(qrcId) Экспорт 
	СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	Если ТипЗнч(СтруктураНастроек) = ТИП("Структура") Тогда
	    Если СтруктураНастроек.Свойство("Пароль")и СтруктураНастроек.Свойство("Логин") Тогда
			Данные = Новый Структура;
			Данные.Вставить("qrcId", qrcId);
			//Данные.Вставить("sign",""); 
				
			ДанныеJSON = СериализоватьВJSON(Данные);
			
			ПараметрыПодключения = ПолучитьПараметрыСоединения();
			HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения);
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-type", "application/json");
			
            Пароль = АльтерраОбщегоНазначения.РаскодироватьИзBase64(СтруктураНастроек.Пароль);
		    Basic = СтруктураНастроек.Логин + ":" + Пароль;
			Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));   
			
			Заголовки.Вставить("Authorization", "Basic " + Basic);  //Логин и пароль закодированные согласно Basic auth
			Заголовки.Вставить("login", СтруктураНастроек.Логин);           
			Заголовки.Вставить("password", Пароль);
			АдресЗапроса = "/merchant/payment/v1/cash-deactivate-qrc/params";
			Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);	 
		Иначе
			Ответ = "Не заполнены Логин и Пароль в настройках";
		КонецЕсли;
		Возврат Ответ;
		
	Иначе
	    Возврат СтруктураНастроек;
	КонецЕсли;
	
КонецФункции

Функция ЗапросСтатусаКассовойСсылкиРасш(qrcId, paramsId)  Экспорт           
	//СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	ПараметрыПодключения = ПолучитьПараметрыСоединения();
	HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения);
	АдресЗапроса = СтрШаблон("/merchant/payment/v1/cash-register-qrc/%1/%2", qrcId, paramsId);
	Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "GET");
	Возврат Ответ;
	//Если ТипЗнч(Ответ) = Тип("Структура") Тогда
	//	Если Ответ.Свойство("data") тогда
	//		cashRegisterQrcStatus = Неопределено;
	//		trxStatus = Неопределено;  
	//		amount = Неопределено;
	//		Ответ.data.Свойство("cashRegisterQrcStatus", cashRegisterQrcStatus); 
	//		Ответ.data.Свойство("trxStatus", trxStatus);
	//		Ответ.data.Свойство("amount", amount); 
	//		timestamp = Неопределено; 
	//		trxId = Неопределено;
	//		payerId = Неопределено;
	//		kzo = Неопределено;
	//		Ответ.data.Свойство("timestamp", timestamp); 
	//		Ответ.data.Свойство("trxId", trxId);
	//		Ответ.data.Свойство("payerId", payerId);
	//		Ответ.data.Свойство("kzo", kzo);

	//	Иначе
	//		КодОшибки = Ответ.code;
	//		ТекстОшибки = Ответ.message;
	//	КонецЕсли;
	//	 
	//ИначеЕсли ТипЗнч(Ответ) = Тип("Строка") Тогда
	//    //сообщить ошибку из ответа
	//КонецЕсли;
	
КонецФункции      

Функция ЗапросСтатусаКассовойСсылкиОсн(qrcId)   Экспорт
	Данные = Новый Структура;
	МассивДанных = Новый Массив;
	МассивДанных.Добавить(qrcId);
	Данные.Вставить("qrcIds", МассивДанных);
	//Данные.Вставить("sign",""); 
		
	ДанныеJSON = СериализоватьВJSON(Данные);
	
	ПараметрыПодключения = ПолучитьПараметрыСоединения();
	HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json");
	//Заголовки.Вставить("Authorization", "");  //Логин и пароль закодированные согласно Basic auth
	//Заголовки.Вставить("login", "");          //Логин выданный ТСП 
	//Заголовки.Вставить("password", "");
	АдресЗапроса = "/merchant/qrc-status";
	Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);	
	Возврат Ответ;
	//Если ТипЗнч(Ответ) = Тип("Структура") Тогда
	//	transactionId = Ответ.transactionId;
	//	Если Ответ.Свойство("data") тогда
	//		qrcId = Ответ.data.qrcId;
	//		code = Ответ.data.code;
	//		message = Ответ.data.message;
	//		status = Неопределено; 
	//		trxId = Неопределено; 
	//		Ответ.data.Свойство("status", status);
	//		Ответ.data.Свойство("trxId", trxId);			
	//	Иначе
	//		КодОшибки = Ответ.code;
	//		ТекстОшибки = Ответ.message;
	//	КонецЕсли;
	//	//sign = Ответ.sign;
	//	//request_sign = Ответ.request_sign;
	//ИначеЕсли ТипЗнч(Ответ) = Тип("Строка") Тогда
	//    //сообщить ошибку из ответа
	//КонецЕсли;
	
КонецФункции

Функция Rollback(qrcId) Экспорт    // аварийный возврат
	СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	Если ТипЗнч(СтруктураНастроек) = ТИП("Структура") Тогда
	    Если СтруктураНастроек.Свойство("Пароль")и СтруктураНастроек.Свойство("Логин") Тогда
			Данные = Новый Структура;
			Данные.Вставить("qrcId", qrcId); 
			//Данные.Вставить("sign",""); 
			
			ДанныеJSON = СериализоватьВJSON(Данные);
			
			ПараметрыПодключения = ПолучитьПараметрыСоединения();
			HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения); 
						
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-type", "application/json");
			
			Пароль = АльтерраОбщегоНазначения.РаскодироватьИзBase64(СтруктураНастроек.Пароль);
		    Basic = СтруктураНастроек.Логин + ":" + Пароль;
			Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));   
			
			Заголовки.Вставить("Authorization", "Basic " + Basic);  //Логин и пароль закодированные согласно Basic auth
			Заголовки.Вставить("login", СтруктураНастроек.Логин);           
			Заголовки.Вставить("password", Пароль);
			
			АдресЗапроса = "/merchant/transfer/rollback";
			Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);
		Иначе
			Ответ = "Не заполнены Логин и Пароль в настройках";
		КонецЕсли;
		
		Возврат Ответ;
		
	Иначе
	    Возврат СтруктураНастроек;
	КонецЕсли;
	
КонецФункции

Функция ПолучениеИнформацииОВозврате(confirmTransactionId)  Экспорт   // /operation/info
	
	СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	Если ТипЗнч(СтруктураНастроек) = ТИП("Структура") Тогда
		Если СтруктураНастроек.Свойство("Пароль")и СтруктураНастроек.Свойство("Логин") Тогда
			Данные = Новый Структура;
			Данные.Вставить("transactionId", confirmTransactionId); //транзакция подтвержения возврата
			//Данные.Вставить("sign",""); 
			
			ДанныеJSON = СериализоватьВJSON(Данные);
			
			ПараметрыПодключения = ПолучитьПараметрыСоединения();
			HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения); 
						
			Заголовки = Новый Соответствие; 
			Заголовки.Вставить("Content-type", "application/json");
			
			Пароль = АльтерраОбщегоНазначения.РаскодироватьИзBase64(СтруктураНастроек.Пароль);
		    Basic = СтруктураНастроек.Логин + ":" + Пароль;
			Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));   
			
			Заголовки.Вставить("Authorization", "Basic " + Basic);  //Логин и пароль закодированные согласно Basic auth
			Заголовки.Вставить("login", СтруктураНастроек.Логин);           
			Заголовки.Вставить("password", Пароль);

			АдресЗапроса = "/operation/info";
			Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);
		Иначе
			Ответ = "Не заполнены Логин и Пароль в настройках";
		КонецЕсли;
		
		Возврат Ответ;
		
	Иначе
	    Возврат СтруктураНастроек;
	КонецЕсли;
	
КонецФункции


Функция ПодготовкаВозврата(ДанныеЗаполнения)  Экспорт
	СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	Если ТипЗнч(СтруктураНастроек) = ТИП("Структура") Тогда
		Если СтруктураНастроек.Свойство("Пароль")и СтруктураНастроек.Свойство("Логин") Тогда
			Данные = Новый Структура;
			Данные.Вставить("transactionId", ДанныеЗаполнения.transactionId); //транзакция, по которой будет проведен возврат
			Данные.Вставить("amount", ДанныеЗаполнения.amount); 
			Данные.Вставить("currency", "RUB"); 
			Если ДанныеЗаполнения.Свойство("comment") Тогда
				Данные.Вставить("comment", ДанныеЗаполнения.comment);
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("recipientBankId") Тогда
				Данные.Вставить("recipientBankId", ДанныеЗаполнения.recipientBankId);
			КонецЕсли;
			//Данные.Вставить("callbackMerchantNotifications", "");
			//Данные.Вставить("sign",""); 
			
			ДанныеJSON = СериализоватьВJSON(Данные);
			
			ПараметрыПодключения = ПолучитьПараметрыСоединения();
			HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения); 
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-type", "application/json");
			
			Пароль = АльтерраОбщегоНазначения.РаскодироватьИзBase64(СтруктураНастроек.Пароль);
		    Basic = СтруктураНастроек.Логин + ":" + Пароль;
			Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));   
			
			Заголовки.Вставить("Authorization", "Basic " + Basic);  //Логин и пароль закодированные согласно Basic auth
			Заголовки.Вставить("login", СтруктураНастроек.Логин);           
			Заголовки.Вставить("password", Пароль);

			АдресЗапроса = "/merchant/transfer/return/prepare";
			Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);
		Иначе
			Ответ = "Не заполнены Логин и Пароль в настройках";
		КонецЕсли;
		
		Возврат Ответ;
		
	Иначе
	    Возврат СтруктураНастроек;
	КонецЕсли;
	
КонецФункции

Функция ПодтверждениеВозврата(prepareTransactionId)  Экспорт
	СтруктураНастроек = ПолучитьСтруктуруХранилищаНастроек();
	Если ТипЗнч(СтруктураНастроек) = ТИП("Структура") Тогда
		Если СтруктураНастроек.Свойство("Пароль")и СтруктураНастроек.Свойство("Логин") Тогда
	
			Данные = Новый Структура;
			Данные.Вставить("transactionId", prepareTransactionId); //транзакция подготовки возврата
			//Данные.Вставить("sign",""); 
			
			ДанныеJSON = СериализоватьВJSON(Данные);
			
			ПараметрыПодключения = ПолучитьПараметрыСоединения();
			HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения); 
			
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Content-type", "application/json");
			
			Пароль = АльтерраОбщегоНазначения.РаскодироватьИзBase64(СтруктураНастроек.Пароль);
		    Basic = СтруктураНастроек.Логин + ":" + Пароль;
			Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));   
			
			Заголовки.Вставить("Authorization", "Basic " + Basic);  //Логин и пароль закодированные согласно Basic auth
			Заголовки.Вставить("login", СтруктураНастроек.Логин);           
			Заголовки.Вставить("password", Пароль); 
			
			АдресЗапроса = "/merchant/transfer/return/confirm";
			Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "POST", Заголовки, ДанныеJSON);
		Иначе
			Ответ = "Не заполнены Логин и Пароль в настройках";
		КонецЕсли;
		
		Возврат Ответ;
		
	Иначе
	    Возврат СтруктураНастроек;
	КонецЕсли;

	
КонецФункции

Функция ПолучитьУчастниковСБП() Экспорт
	ПараметрыПодключения = ПолучитьПараметрыСоединения();
	HTTPСоединение = ПолучитьHTTPСоединение(ПараметрыПодключения);
	АдресЗапроса = "/merchant/v2/transfer/banks";
	Ответ = ПослатьHTTPЗапрос(АдресЗапроса, HTTPСоединение, "GET");
	Возврат Ответ;
	
	//Данные = "{""code"": ""000"", ""message"": ""Запрос обработан успешно"", ""transactionId"": ""003665567575"", ""members"": [{""memberId"": ""100000000202"", ""memberName"": ""Norvik Bank"", ""memberNameRus"": ""Норвик Банк""}, {""memberId"": ""100000000201"", ""memberName"": ""BANK KREMLYOVSKIY"", ""memberNameRus"": ""Банк Кремлевский""}, {""memberId"": ""100000000200"", ""memberName"": ""JSCB SLAVIA"", ""memberNameRus"": ""АКБ СЛАВИЯ""}]}";
	//ДанныеОтвета = ДесериализоватьИзJSON(Данные);
	//Возврат ДанныеОтвета;
	
КонецФункции


Процедура ЗаписьIDТранзакцииВРегистрСБП(ДокументСсылка, IDТранзакции, СБП = Ложь) Экспорт
	
	//запись ID в регистр
	НаборЗаписей = РегистрыСведений.ДанныеБезналичныхОплат.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОплаты.Установить(ДокументСсылка);
	НаборЗаписей.Очистить();
	ЗаписьВРегистр = НаборЗаписей.Добавить();
	ЗаписьВРегистр.ДокументОплаты = ДокументСсылка;
	ЗаписьВРегистр.IDТранзакции = IDТранзакции;
	ЗаписьВРегистр.СБП = СБП;
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 

Функция ПолучитьДанныеТранзакции(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеБезналичныхОплат.IDТранзакции КАК IDТранзакции,
		|	ДанныеБезналичныхОплат.СБП КАК СБП
		|ИЗ
		|	РегистрСведений.ДанныеБезналичныхОплат КАК ДанныеБезналичныхОплат
		|ГДЕ
		|	ДанныеБезналичныхОплат.ДокументОплаты = &ДокументОплаты";
	Запрос.УстановитьПараметр("ДокументОплаты", ДокументСсылка);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("IDТранзакции", Выборка.IDТранзакции);
		СтруктураДанных.Вставить("СБП", Выборка.СБП);
		Возврат СтруктураДанных;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции 

Функция БылаОперацияСБП(IDТранзакции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеБезналичныхОплат.СБП КАК СБП
		|ИЗ
		|	РегистрСведений.ДанныеБезналичныхОплат КАК ДанныеБезналичныхОплат
		|ГДЕ
		|	ДанныеБезналичныхОплат.IDТранзакции = &IDТранзакции";
	Запрос.УстановитьПараметр("IDТранзакции", IDТранзакции);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СБП;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции 

Функция ПолучитьТерминалСБППоУмолчанию() Экспорт
	Возврат Справочники.ЭквайринговыеТерминалы.НайтиПоНаименованию("СБП Газпромбанк");
КонецФункции 

Функция ПолучитьКассовуюСсылкуДляКассыККМ(КассаККМ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	КассовыеСсылкиСБП.КассаККМ КАК КассаККМ,
					|	КассовыеСсылкиСБП.ИдентификаторСсылки КАК ИдентификаторСсылки,
					|	КассовыеСсылкиСБП.КассоваяСсылкаНаОплату КАК КассоваяСсылкаНаОплату
					|ИЗ
					|	РегистрСведений.КассовыеСсылкиСБП КАК КассовыеСсылкиСБП
					|ГДЕ
					|	КассовыеСсылкиСБП.КассаККМ = &КассаККМ";
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("grcId", Выборка.ИдентификаторСсылки);
		СтруктураВозврата.Вставить("payload", Выборка.КассоваяСсылкаНаОплату);
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
    УстановитьПривилегированныйРежим(Ложь);

	
КонецФункции

Функция ПолучитьКассовуюСсылкуДляТерминалаКассы(КассаККМ, Терминал = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	КассовыеСсылкиСБП.КассаККМ КАК КассаККМ,
					|	КассовыеСсылкиСБП.ИдентификаторСсылки КАК ИдентификаторСсылки,
					|	КассовыеСсылкиСБП.КассоваяСсылкаНаОплату КАК КассоваяСсылкаНаОплату
					|ИЗ
					|	РегистрСведений.КассовыеСсылкиСБП КАК КассовыеСсылкиСБП
					|ГДЕ
					|	КассовыеСсылкиСБП.КассаККМ = &КассаККМ
					|   И &Терминал";
	Если Терминал <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Терминал", "КассовыеСсылкиСБП.ЭквайринговыйТерминал = &Терминал");
		Запрос.УстановитьПараметр("Терминал", Терминал);
	Иначе
		Запрос.УстановитьПараметр("Терминал", Истина);
	КонецЕсли;
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("grcId", Выборка.ИдентификаторСсылки);
		СтруктураВозврата.Вставить("payload", Выборка.КассоваяСсылкаНаОплату);
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
    УстановитьПривилегированныйРежим(Ложь);

	
КонецФункции

Процедура ОбработатьОплатуВЧекККМ(РезультатВыполнения, Объект)  Экспорт
	
	ОплатыСБП = ОплатыСБП(Объект.ОплатаПлатежнымиКартами);
	Для Каждого СтрокаОплатыСБП Из ОплатыСБП Цикл
		Объект.ОплатаПлатежнымиКартами.Удалить(СтрокаОплатыСБП);
	КонецЦикла; 
	
	СтрокаСБП = Объект.ОплатаПлатежнымиКартами.Добавить();
	СтрокаСБП.ВидОплаты = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей");
	СтрокаСБП.Сумма = РезультатВыполнения.СуммаОперации;
	СтрокаСБП.СсылочныйНомер = РезультатВыполнения.ИдентификаторОплаты;
	ТерминалСБП = ИнтеграцияСБПГазпромбанк.ПолучитьТерминалСБППоУмолчанию();
	СтрокаСБП.ДоговорПодключения = ТерминалСБП.Владелец;
	СтрокаСБП.ЭквайринговыйТерминал = ТерминалСБП;
	СтрокаСБП.СтатусОплатыСБП = ПредопределенноеЗначение("Перечисление.ТипыСтатусовОплатыСБП.Выполнена");
	
КонецПроцедуры 

Процедура ОбработатьОплатуВЧекККМНаВозврат(РезультатВыполнения, Объект)  Экспорт
	
	НомерСтрокиОплатыСБП = Неопределено; 
		
	ОплатыСБП = ОплатыСБП(Объект.ОплатаПлатежнымиКартами);
	Если ОплатыСБП.Количество() > 0 Тогда
		НомерСтрокиОплатыСБП = ОплатыСБП[0].НомерСтроки;
		Объект.ОплатаПлатежнымиКартами[НомерСтрокиОплатыСБП - 1].ОплатаОтменена = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ЧекККМ) Тогда
		СтрокаСБП = Объект.ОплатаПлатежнымиКартами.Добавить();
		СтрокаСБП.ВидОплаты = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей");
		СтрокаСБП.Сумма = РезультатВыполнения.СуммаОперации;
		ТерминалСБП = ИнтеграцияСБПГазпромбанк.ПолучитьТерминалСБППоУмолчанию();
		СтрокаСБП.ДоговорПодключения = ТерминалСБП.Владелец;
		СтрокаСБП.ЭквайринговыйТерминал = ТерминалСБП;  
		СтрокаСБП.ЭквайринговыйТерминал = ИнтеграцияСБПГазпромбанк.ПолучитьТерминалСБППоУмолчанию();
		СтрокаСБП.ОплатаОтменена = Истина;
	КонецЕсли;
		
		

КонецПроцедуры

Процедура ОбработатьОплатуВЭквайринге(РезультатВыполнения, Объект)  Экспорт
		
	Объект.ОплатаВыполнена = Истина;
	Объект.ИдентификаторОплатыСБП = РезультатВыполнения.ИдентификаторОплаты;
	ТерминалСБП = ИнтеграцияСБПГазпромбанк.ПолучитьТерминалСБППоУмолчанию();
	Объект.ЭквайринговыйТерминал = ТерминалСБП;
	Объект.ДоговорЭквайринга = ТерминалСБП.Владелец; 
		

КонецПроцедуры 

Функция ОплатыСБП(ОплатаПлатежнымиКартами)
	
	ОтборОплатыСБП = Новый Структура("ВидОплаты", ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей"));
	Возврат ОплатаПлатежнымиКартами.НайтиСтроки(ОтборОплатыСБП);
	
КонецФункции
